

// Описание
// 
// Параметры:
// 	ПользовательИБ - ПользовательИнформационнойБазы - 
Процедура ЗаполнитьНаборПрав(ПользовательИБ) Экспорт
	РолиИБ = Метаданные.Роли;
	
	ЭтотОбъект.НаборПрав.Очистить();
	Для Каждого Роль Из РолиИБ Цикл
		СтрокаНабораПрав = ЭтотОбъект.НаборПрав.Добавить();
		СтрокаНабораПрав.ИмяРоли = Роль.Имя;
		СтрокаНабораПрав.ПредставлениеРоли = Роль.Синоним;
		СтрокаНабораПрав.Активна = ПользовательИБ.Роли.Содержит(Роль);		
	КонецЦикла;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//TODO: Вставить содержимое обработчика
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование);
	
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = ЭтотОбъект.Наименование;
		ПользовательИБ.ПолноеИмя = ЭтотОбъект.ПолноеИмя;		
	КонецЕсли;
	
	ПользовательИБ.Роли.Очистить();
	НаборПравПользователя = ЭтотОбъект.НаборПрав.НайтиСтроки(Новый Структура("Активна", Истина));
	
	Для Каждого СтрокаРолиПользователя Из НаборПравПользователя Цикл
		ТекущаяРоль = Метаданные.Роли.Найти(СтрокаРолиПользователя.ИмяРоли);
		ПользовательИБ.Роли.Добавить(ТекущаяРоль);
	КонецЦикла;
	ПользовательИБ.Записать();
КонецПроцедуры
